10/data/attachments/ed629df8470324c2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6a098ebe-a316-49a3-a6fa-8377ab78b4e0</nif:username>
            <nif:friendToBeAdded>Monica_relate_Friend_50549_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>